app/views/task_entries/_form.html.erb

SELECT `task_statuses`.* FROM `task_statuses`
---
      <td>
        <%= f.collection_select :task_status_id,TaskStatus.all,:id,:status_name,{},{:style => 'width:267px;'} %>