app/controllers/task_entries_controller.rb

  def index
    @task_entries = TaskEntry.all
---
SELECT `task_entries`.* FROM `task_entries`

  def show
    @task_entry = TaskEntry.find(params[:id])
---
SELECT `task_entries`.* FROM `task_entries` WHERE `task_entries`.`id` = 2 LIMIT 1

  def edit
    @task_entry = TaskEntry.find(params[:id])
---
SELECT `task_entries`.* FROM `task_entries` WHERE `task_entries`.`id` = 3 LIMIT 1

  def create
    @task_entry = TaskEntry.new(params[:task_entry])

    respond_to do |format|
      if @task_entry.save
---
INSERT INTO `task_entries` (`task_name`, `task_description`, `deadline`, `task_status_id`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, '2012-03-05 10:12:44', '2012-03-05 10:12:44')

  def update
    @task_entry = TaskEntry.find(params[:id])

    respond_to do |format|
      if @task_entry.update_attributes(params[:task_entry])
---
SELECT `task_entries`.* FROM `task_entries` WHERE `task_entries`.`id` = 3 LIMIT 1
UPDATE `task_entries` SET `task_description` = 'task two', `updated_at` = '2012-03-05 10:29:34' WHERE `task_entries`.`id` = 3

  def destroy
    @task_entry = TaskEntry.find(params[:id])
    @task_entry.destroy
---
SELECT `task_entries`.* FROM `task_entries` WHERE `task_entries`.`id` = 3 LIMIT 1
DELETE FROM `task_entries` WHERE `task_entries`.`id` = 3